In [1]:
import pandas as pd
d = pd.Series(range(20))
d

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int64

In [2]:
d.cumsum()

0       0
1       1
2       3
3       6
4      10
5      15
6      21
7      28
8      36
9      45
10     55
11     66
12     78
13     91
14    105
15    120
16    136
17    153
18    171
19    190
dtype: int64

Series  DataFrame

In [3]:
import pandas as pd
a = pd.Series([9,7,5,3])
a

0    9
1    7
2    5
3    3
dtype: int64

In [5]:
import pandas as pd
a = pd.Series([9,7,5,3],index=['a','b','c','d'])
a

a    9
b    7
c    5
d    3
dtype: int64

In [6]:
import pandas as pd
a = pd.Series([9,7,5,3],['a','b','c','d'])
a

a    9
b    7
c    5
d    3
dtype: int64

In [7]:
import pandas as pd
a = pd.Series(25,['a','b','c','d'])
a

a    25
b    25
c    25
d    25
dtype: int64

In [9]:
import pandas as pd
a = pd.Series({'a':9,'b':8,'c':5,'d':3})
a

a    9
b    8
c    5
d    3
dtype: int64

In [13]:
import pandas as pd
a = pd.Series({'a':9,'b':8,'c':5,'d':3},index=['c','b','c','d'])
a

c    5
b    8
c    5
d    3
dtype: int64

https://blog.csdn.net/linzch3/article/details/71046340
【MOOC】Python数据分析与展示-北京理工大学-【第三周】数据分析之概要

In [9]:
import pandas as pd
import numpy as np
a = pd.DataFrame(np.arange(12).reshape(3,4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [14]:
import pandas as pd
import numpy as np
a1 = pd.DataFrame(np.arange(9).reshape(3,3))
a1

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [11]:
import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(5,4))
b

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [15]:
a+b

      0     1     2   3
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN
4   NaN   NaN   NaN NaN

In [16]:
a*b

      0     1     2   3
0   0.0   1.0   4.0 NaN
1  12.0  20.0  30.0 NaN
2  48.0  63.0  80.0 NaN
3   NaN   NaN   NaN NaN
4   NaN   NaN   NaN NaN

In [17]:
b.add(a,fill_value = 100)

       0      1      2      3
0    0.0    2.0    4.0  103.0
1    7.0    9.0   11.0  107.0
2   14.0   16.0   18.0  111.0
3  112.0  113.0  114.0  115.0
4  116.0  117.0  118.0  119.0

In [18]:
b.add(a,fill_value = 0)

      0     1     2     3
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0
4  16.0  17.0  18.0  19.0

In [21]:
a.mul(b,fill_value=100)

        0       1       2       3
0     0.0     1.0     4.0   300.0
1    12.0    20.0    30.0   700.0
2    48.0    63.0    80.0  1100.0
3  1200.0  1300.0  1400.0  1500.0
4  1600.0  1700.0  1800.0  1900.0

In [24]:
import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(5,4))
c = pd.Series(np.arange(4)) 
b
print(b)
c

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

0    0
1    1
2    2
3    3
dtype: int32

In [25]:
c-10

0   -10
1    -9
2    -8
3    -7
dtype: int32

In [26]:
b-c

    0   1   2   3
0   0   0   0   0
1   4   4   4   4
2   8   8   8   8
3  12  12  12  12
4  16  16  16  16

In [27]:
b*c

   0   1   2   3
0  0   1   4   9
1  0   5  12  21
2  0   9  20  33
3  0  13  28  45
4  0  17  36  57

In [31]:
b > c

0    False
1    False
2    False
3    False
dtype: bool

In [32]:
b<c

0    False
1    False
2    False
3    False
dtype: bool

In [35]:
b = c

In [3]:
import pandas as pd
import numpy as np
a = pd.DataFrame(np.arange(12).reshape(3,4))

d1 = {'one':[1,2,3,4],'two':[9,8,7,6]}

d = pd.DataFrame(d1,index = ['a','b','c','d'])
      
d
pr

   one  two
a    1    9
b    2    8
c    3    7
d    4    6

In [ ]:
one>two

In [8]:

import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(4,5))
c = pd.Series(np.arange(4)) 
b.sort_index()

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [9]:
b.sort_index()

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [12]:
b.sort_index(ascending=False)

    0   1   2   3   4
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

In [14]:
b.sort_index(axis=1,ascending=False)

    4   3   2   1   0
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

In [16]:
b.sort_index(axis=0,ascending=False)

    0   1   2   3   4
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

In [ ]:
.sort_values

In [18]:

import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(4,5),index['c','a','d','b'])
b

NameError: name 'index' is not defined

In [19]:

import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(4,5))
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [22]:

import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [29]:
c = b.sort_values(3,ascending=False)
c

    0   1   2   3   4
b  15  16  17  18  19
d  10  11  12  13  14
a   5   6   7   8   9
c   0   1   2   3   4

In [32]:
c = b.sort_values('a',axis=1,ascending=False)
print(b)
c

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

    4   3   2   1   0
c   4   3   2   1   0
a   9   8   7   6   5
d  14  13  12  11  10
b  19  18  17  16  15

In [33]:
b.describe()

               0          1          2          3          4
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [34]:
type(b.describe())

pandas.core.frame.DataFrame

In [38]:
b.describe().ix['min']

d:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
Name: min, dtype: float64

In [39]:
b.describe().ix['max']

d:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    15.0
1    16.0
2    17.0
3    18.0
4    19.0
Name: max, dtype: float64

In [40]:
b.describe()[2]

count     4.000000
mean      9.500000
std       6.454972
min       2.000000
25%       5.750000
50%       9.500000
75%      13.250000
max      17.000000
Name: 2, dtype: float64

In [41]:
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [44]:

import pandas as pd
import numpy as np
b = pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])
b.cumsum()

    0   1   2   3   4
c   0   1   2   3   4
a   5   7   9  11  13
d  15  18  21  24  27
b  30  34  38  42  46

In [45]:
b.cumprod()

   0     1     2     3     4
c  0     1     2     3     4
a  0     6    14    24    36
d  0    66   168   312   504
b  0  1056  2856  5616  9576

In [47]:
print(b)
b.cummax()

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [48]:
b.cummin()

   0  1  2  3  4
c  0  1  2  3  4
a  0  1  2  3  4
d  0  1  2  3  4
b  0  1  2  3  4

In [50]:
print(b)
b.rolling(2).sum()

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

      0     1     2     3     4
c   NaN   NaN   NaN   NaN   NaN
a   5.0   7.0   9.0  11.0  13.0
d  15.0  17.0  19.0  21.0  23.0
b  25.0  27.0  29.0  31.0  33.0

In [51]:
print(b)
b.rolling(3).sum()

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

      0     1     2     3     4
c   NaN   NaN   NaN   NaN   NaN
a   NaN   NaN   NaN   NaN   NaN
d  15.0  18.0  21.0  24.0  27.0
b  30.0  33.0  36.0  39.0  42.0

In [ ]:
协方差，标准差